content/topics/python.md
+++
title = "Python"
author = ["Dorneanu"]
draft = false
+++

## Resources {#resources}

-   2023-04-18 ◦ [cosmic_python](https://www.cosmicpython.com/)
    -   simple patterns for building complex applications
-   2026-06-04 ◦ [AI Engineering from Scratch](https://aiengineeringfromscratch.com/) — Python is the primary language in this 503-lesson open-source [AI engineering]({{< relref "ai_engineering.md" >}}) curriculum; every algorithm derived from raw math then implemented in Python (+ TypeScript, Rust, Julia)
